<?php

/**
 * Translation file may have language keys that is associated with a list of translated lines.
 * In that case only one line will be rendered and will be chosen in a random way.
 * - Emoji are allowed
 * - Styling are allowed
 *
 * @see https://core.telegram.org/api/entities
 */
return [
    'error'  => [
        'Почекайте, почекайте.. ',
        'шось голова болить, психічне порушення',
        'У всьому винен ахмєтов-пєтух',
        'Підарів більше немає, але ви тримайтесь.',
        'Ми тебе шукаємо… 937-99-92',
    ],

    'error-nickname-empty' => [
        'Без нікнейма не берем, сорян',
        'Спочатку додай собі нікнейм в тєлєгу',
        'В тебе немає нікнейма, оголошую підаром достроково!',
        'Ану вийди і зайди як нормальні люди',
    ],

    // Command /pidarreg
    'pidar-reg-ok' => [
        'Записав, маладєц, маєш яйця',
        'Вітаю, ти в списку, будь готов стати підаром',
        'Welcome to night city, dear))',
    ],
    'pidar-reg-already-registered' => [
        'Вже записаний, готуй очко',
        '<i>Двічі в одну річку не ввійдеш… Двічі одне очко не взірвеш.</i>',
        'Ти попросив стати підаром, але попросив без поваги…',
    ],

    // Command /pidarall
    'pidar-all-no-records' => [
        'Нема підарів 😢',
    ],
    'pidar-all-header' => "<b>Топ підарів за весь час:</b>\n",
    'pidar-all-times' => '{0} |{1} (1 раз)|[2,4] (:count рази)|[5,*] (:count разів)',
    'pidar-all-line-emoji' => '{1} 🥇|{2} 🥈|{3} 🥉|[4,*] 🏅',
    'pidar-all-line' => ":emoji :position місце - <b>:username</b> :times\n",

    // Command /pidar
    'pidar-already-exists' => [
        'Підар дня вже є, і це :username 👏',
        'За моєю інформацією :username вже підар дня',
        'Астрологи вже оголосили підаром дня :username',
        'В сьогоднішній день не кожен може бути підаром, але ми можемо. - Пан :username , провідний спеціаліст',
        'На Підар-TV репортери досі спостерігають, що титул підара носить :username',
    ],
    'pidar-triggered-not-registered' => [
        'Не зарегався і трігериш мене? Ну ти і підар, я тебе запомнив',
        'Ого, бач який підар, готуй очко',
        'Превентивно захотів залучитися? А хуй тобі. Знімай штани і заходь по-нормальному.',
    ],
    'pidar-start' => [
        'Опа опа',
        'Всім ховатись',
        'Підарами запахло',
        '‼️ Підарна тривога!',
        '♂️Служба пошуку підарів♂️ активована!',
    ],
    'pidar-step-1' => [
        'Охрана отмєна',
        'СБУ вже виїхало',
        'Я їбав такі качелі…',
        'Всім негайно в укриття!',
        'Жоден ♂️fat cock♂️ не сховається!',
    ],
    'pidar-step-2' => [
        'Наводжу справки з воєнкомата..',
        'Розрахунок цілі',
        'Координати очка знайдені!',
        'Мама, я в плєну, мой БТР падбітий..',
        'Ох ох, мій детектор підарів зашкалює',
    ],
    'pidar-result' => [
        'Підар дня :username 👏',
        'Привітайте підара дня :username',
        'За обширні досягнення у ході експлуатації очка, підаром дня нагороджується :username <i>Підр, підр, УРА!</i>',
        'Місто має знати своїх героїв. Сьогодні :username - Палій Трави!',
        'Не розчаровуйся, :username, це краще, ніж бути русскім.',
        'А сьогодні, в цей чудовий час доби, ♂підаром♂ дня стає :username! Хоч і все ще не ♂dungeon master♂',
        'Вас багато, а от підар дня один - :username 🎉',
    ],
];
