<?php

/**
 * Translation file may have language keys that is associated with a list of translated lines.
 * In that case only one line will be rendered and will be chosen in a random way.
 * - Emoji are allowed
 * - Styling are allowed
 *
 * @see https://core.telegram.org/api/entities
 */
return [
    'error'  => [
        'Почекайте, почекайте.. ',
        'шось голова болить, психічне порушення',
        'У всьому винен ахмєтов-пєтух',
        'Підарів більше немає, але ви тримайтесь.',
        'Ми тебе шукаємо… 937-99-92',
        'Я на тех-обслуговуванні. Передзвоніть <s>ніколи</s> пізніше.',
    ],

    'error-nickname-empty' => [
        'Без нікнейма не берем, сорян',
        'Спочатку додай собі нікнейм в тєлєгу',
        'В тебе немає нікнейма, оголошую підаром достроково!',
        'Ану вийди і зайди як нормальні люди',
    ],
    'success' => [
        'Окей окей',
        'Готово dungeon master',
        'Наступного разу бери випивку',
        'Слухаюсь..',
        'Як скажеш)',
        'Може сам якось?',
        'Ага, ок.',
    ],

    // Command /pidarreg
    'pidar-reg-ok' => [
        'Записав, маладєц, маєш яйця',
        'Вітаю, ти в списку, будь готов стати підаром',
        'Welcome to night city, dear))',
    ],
    'pidar-reg-already-registered' => [
        'Вже записаний, готуй очко',
        '<i>Двічі в одну річку не ввійдеш… Двічі одне очко не взірвеш.</i>',
        'Ти попросив стати підаром, але попросив без поваги…',
    ],

    // Command /pidarall
    'pidar-all-no-records' => [
        'Нема підарів 😢',
    ],
    'pidar-all-header' => "<b>Топ підарів за весь час:</b>\n",
    'pidar-year-header' => "<b>Топ підарів за цей рік:</b>\n",
    'pidar-month-header' => "<b>Топ підарів за цей місяць:</b>\n",
    'pidar-week-header' => "<b>Топ підарів за цей тиждень:</b>\n",
    'pidar-all-times' => '{0} |{1} (1 раз)|[2,4] (:count рази)|[5,*] (:count разів)',
    'pidar-all-line-emoji' => '{1} 🥇|{2} 🥈|{3} 🥉|[4,*] 🏅',
    'pidar-all-line' => ":emoji :position місце - <b>:username</b> :times\n",

    // Command /pidar
    'pidar-already-exists' => [
        'Підар дня вже є, і це :username 👏',
        'За моєю інформацією :username вже підар дня',
        'Астрологи вже оголосили підаром дня :username',
        'В сьогоднішній день не кожен може бути підаром, але ми можемо. - Пан :username , провідний спеціаліст',
        'На Підар-TV репортери досі спостерігають, що титул підара носить :username',
        'Реєстри не брешуть, сьогодні :username вже підар.',
        'Я знаю, що підарів багато, але вистачить нам :username на сьогодні.',
        'Зараз подивлюсь.. Ага, ну то ж :username вже підар, які питання?',
        'Можливо він це довго приховував, але, насправді, :username - підар',
        'Я уже перевірив доступні отвори :username, безсумнівно - підар',
        'Це ж було вже, :username - підар. Краще не трігеріть, доки думку не змінив.',
    ],
    'pidar-triggered-not-registered' => [
        'Не зарегався і трігериш мене? Ну ти і підар, я тебе запомнив',
        'Ого, бач який підар, готуй очко',
        'Превентивно захотів залучитися? А хуй тобі. Знімай штани і заходь по-нормальному.',
        'Знайти підара по-тихому? Так ти сам, ще той підар!',
    ],
    'pidar-automated-trigger' => [
        'Давно підарів не бачив..',
        'Скучили? 😳',
        'А я й забув про вас (ні, не забув)..',
        'Не чекали? А я вже тут 🌚',
        '<b>ДВЕРІ ВІДКРИВАЙТЕ!</b>',
        'Ранок починається не з кави, а з нових підарів',
        'Сьогодні особливий день. Чому? Тому що.',
        'Якісь перешкоди, викликані ретроградним Юпітером, немає часу пояснювати.',
        'Ох-ох, тільки не кажіть, що забули за мене. А я за вас ні 😄',
        'Спеціальна пропозиція, тільки сьогодні і тільки для вас. Один підар за ціною двох.',
        'Руки на стіл! 👊',
    ],
    'pidar-start' => [
        'Всім ховатись, але це вам не допоможе',
        'Підарами запахло',
        '‼️ Підарна тривога!',
        '♂️Служба пошуку підарів♂️ активована!',
        '🛑УВАГА! ПІДАРНА ТРИВОГА🛑',
        'AVENGERS, ASSemble!',
        'Добрий вечір, діти! Знов позаходили під чужими іменами..',
        'Ділом займись, єблан..',
        'Інформаційно-аналітична система розпізнавання квазіпікових сигналів підарів активована',
        'Доброго вечора, хто ♂️boss of this gym♂️?',
        'Зараз я перевірю кожну ♂️ass hole♂️ в цьому чаті!',
        'Так, так, так',
        'Можливо, той хто мене розбудив, і є підар?',
        'Всі пісюни на рояль, щоб я бачив. Починаю пошук...',
    ],
    'pidar-step-1' => [
        'Охрана отмєна',
        'СБУ вже виїхало',
        'Я їбав такі качелі…',
        'Всім негайно в укриття!',
        'Жоден ♂️fat cock♂️ не сховається!',
        'Божечки, божечки..',
        'Ви в зоні ризику, рекомендую не вийобуваться.',
        'А где бомбілі 8 ти бил назад лет донбас когда?',
        'Еслі ви відєлі підара, обратітєсь по номеру 937-99-92..',
        'Підключення до GPS (Global Pidar Search)..',
        'Пуск ракети РЕП(Радіо-електронної підарасні). 300-30-3!',
    ],
    'pidar-step-2' => [
        'Наводжу справки з воєнкомата..',
        'Розрахунок цілі',
        'Координати очка знайдені!',
        'Мама, я в плєну, мой БТР падбітий..',
        'Ох ох, мій детектор підарів зашкалює',
        'Не сцять, пошук вже завершено',
        'А я знаю, що ти дрочиш',
        'Вилкою в глаз, чи в жопу раз? Як бачиш, вилки у мене нема',
        'Госпаді, як малі діти..',
        'ЯРІК БЛЯТЬ, БАЧОК!!!',
        'О блять, знайомі люди, нічого нового..',
        'Перевіряю усі вхідні отвори...',
        'Готуюсь винести вердикт, доки очко підара не остигло',
        'Скільки кажеш хлопців у тебе було?',
        'Чую протяг з чийогось очка, іду на звук',
    ],
    'pidar-result' => [
        'Підар дня :username 👏',
        'Привітайте підара дня :username',
        'За обширні досягнення у ході експлуатації очка, підаром дня нагороджується :username <i>Підр, підр, УРА!</i>',
        'Місто має знати своїх героїв. Сьогодні :username - Палій Трави!',
        'Не розчаровуйся, :username, це краще, ніж бути русскім.',
        'А сьогодні, в цей чудовий час доби, ♂підаром♂ дня стає :username! Хоч і все ще не ♂dungeon master♂',
        'Вас багато, а от підар дня один - :username 🎉',
        'А сегодня в завтрашний день не все могут смотреть на підара дня :username! 🎉🎉🎉',
        'Всеукраїнським СМС голосуванням, підаром дня обрано :username ! <b>Вітаємо переможця!</b>',
        ':username, ну ти і ♂геймер♂..',
        'Урочисто привітаймо :username - підара дня. Хай лунають тости, Тости, ТОСТИ!! Хай танцюють гості, Гості ГОСТІ!!',
        'Останні знімки телескопа Hubble довели, що :username сьогодні підар дня!',
        'Я ЖИ-ВИИИИИЙ, Я СИЛЬ-НИИИИИЙ, але трохи підар - Я :username',
        'Ну нічого, що :username - підар, головне, щоб людиною був хорошою (ніт)',
        'Не знаю як Ляшко, а от :username - підар',
    ],
];
